duxinglang-1/nRF9160_test/JPR/src/sensor/lsm6dso.c
#include <nrf9160.h>
#include <zephyr.h>
#include <device.h>
#include <sys/printk.h>
#include <drivers/i2c.h>
#include <drivers/gpio.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "lsm6dso_reg.h"

#include <logging/log_ctrl.h>
#include <logging/log.h>
LOG_MODULE_REGISTER(lsm6dso, CONFIG_LOG_DEFAULT_LEVEL);

typedef union{
  int16_t i16bit[3];
  uint8_t u8bit[6];
} axis3bit16_t;

#define I2C_DEV "I2C_1"

#define LSM6DSO_I2C_ADD     LSM6DSO_I2C_ADD_L >> 1 //need to shift 1 bit to the right.

#define LSM6DSO_INT1_PIN	09
#define LSM6DSO_INT2_PIN	10
#define LSM6DSO_SDA_PIN		11
#define LSM6DSO_SCL_PIN		12

#define BUT_PIN		6  //pin for button1-press interrupt

#ifdef DT_ALIAS_SW0_GPIOS_FLAGS
#define PULL_UP DT_ALIAS_SW0_GPIOS_FLAGS
#else
#define PULL_UP 0
#endif

#define EDGE (GPIO_INT_EDGE | GPIO_INT_DOUBLE_EDGE)

static axis3bit16_t data_raw_acceleration;
static axis3bit16_t data_raw_angular_rate;

stmdev_ctx_t imu_dev_ctx;
lsm6dso_pin_int1_route_t int1_route;
lsm6dso_pin_int2_route_t int2_route;
lsm6dso_all_sources_t all_source;

static float acceleration_mg[3];
static float angular_rate_mdps[3];
static float acceleration_g[3];
static float angular_rate_dps[3];

static uint8_t whoamI, rst;
struct device *LSM6DSO_I2C;
uint8_t is_tilt;
static uint16_t steps; //step counter
struct device *interrupt;
struct device *gpiob;
static struct gpio_callback gpio_cb;
static struct gpio_callback gpio_cb2;

static struct k_timer get_steps_timer;

volatile bool single_tap_event = false;
volatile bool button_flag = false;

bool read_imu_steps = false;
bool reset_imu_steps = false;

u16_t g_steps = 0;
u16_t g_calorie = 0;
u16_t g_distance = 0;

static uint8_t init_i2c(void)
{
	LSM6DSO_I2C = device_get_binding(I2C_DEV);
	if(!LSM6DSO_I2C)
	{
		LOG_INF("ERROR SETTING UP I2C\r\n");
		return -1;
	}
	else
	{
		i2c_configure(LSM6DSO_I2C, I2C_SPEED_SET(I2C_SPEED_FAST));
		return 0;
	}
}

static int32_t platform_write(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;
	uint8_t data[len+1];

	data[0] = reg;
	memcpy(&data[1], bufp, len);
	rslt = i2c_write(LSM6DSO_I2C, data, len+1, LSM6DSO_I2C_ADD);

	return rslt;
}

static int32_t platform_read(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;

	rslt = i2c_write(LSM6DSO_I2C, &reg, 1, LSM6DSO_I2C_ADD);
	if(rslt == 0)
	{
		rslt = i2c_read(LSM6DSO_I2C, bufp, len, LSM6DSO_I2C_ADD);
	}

	return rslt;
}

void interrupt_event(struct device *interrupt, struct gpio_callback *cb, u32_t pins)
{
	single_tap_event = true;
}

void button_pressed(struct device *gpiob, struct gpio_callback *cb, u32_t pins)
{
	LOG_INF("Button pressed\n");
	button_flag = true;
}

uint8_t init_gpio(void)
{
	interrupt = device_get_binding(DT_GPIO_P0_DEV_NAME);
	gpiob = device_get_binding(DT_GPIO_P0_DEV_NAME);

	gpio_pin_configure(interrupt, LSM6DSO_INT2_PIN, (GPIO_DIR_IN | GPIO_INT | GPIO_INT_EDGE | GPIO_PUD_PULL_DOWN | GPIO_INT_ACTIVE_HIGH)); //configure the single tap/tilt interrupt
	gpio_pin_configure(gpiob, BUT_PIN, (GPIO_DIR_IN | GPIO_INT | PULL_UP | EDGE | GPIO_INT_ACTIVE_LOW | GPIO_INT_ACTIVE_HIGH));      //configure the button1-press interrupt

	gpio_init_callback(&gpio_cb, interrupt_event, BIT(LSM6DSO_INT2_PIN));
	gpio_init_callback(&gpio_cb2, button_pressed, BIT(BUT_PIN));

	gpio_add_callback(interrupt, &gpio_cb);
	gpio_add_callback(gpiob, &gpio_cb2);

	gpio_pin_enable_callback(gpiob, BUT_PIN);
	gpio_pin_enable_callback(interrupt,LSM6DSO_INT2_PIN);

	return 0;
}

void sensor_init(void)
{
	lsm6dso_device_id_get(&imu_dev_ctx, &whoamI);
	if(whoamI != LSM6DSO_ID)
		while(1);

	lsm6dso_reset_set(&imu_dev_ctx, PROPERTY_ENABLE);
	do
	{
		lsm6dso_reset_get(&imu_dev_ctx, &rst);
	}while(rst);

	lsm6dso_i3c_disable_set(&imu_dev_ctx, LSM6DSO_I3C_DISABLE);

	lsm6dso_xl_full_scale_set(&imu_dev_ctx, LSM6DSO_2g);
	lsm6dso_gy_full_scale_set(&imu_dev_ctx, LSM6DSO_250dps);
	lsm6dso_block_data_update_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_417Hz);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_417Hz);

	lsm6dso_tap_detection_on_z_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_y_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_x_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_tap_threshold_x_set(&imu_dev_ctx, 0x09);
	lsm6dso_tap_threshold_y_set(&imu_dev_ctx, 0x09);
	lsm6dso_tap_threshold_z_set(&imu_dev_ctx, 0x09);

	lsm6dso_tap_quiet_set(&imu_dev_ctx, 0x03);
	lsm6dso_tap_shock_set(&imu_dev_ctx, 0x03);

	lsm6dso_tap_mode_set(&imu_dev_ctx, LSM6DSO_ONLY_SINGLE);

	lsm6dso_tilt_sens_set(&imu_dev_ctx, PROPERTY_ENABLE); 

	lsm6dso_pedo_sens_set(&imu_dev_ctx, LSM6DSO_PEDO_BASE_MODE);

	lsm6dso_pin_int2_route_get(&imu_dev_ctx, &int2_route);
	int2_route.md2_cfg.int2_single_tap = PROPERTY_ENABLE;
	int2_route.emb_func_int2.int2_tilt = PROPERTY_ENABLE;
	lsm6dso_pin_int2_route_set(&imu_dev_ctx, &int2_route);

	LOG_INF("Sensor Init Done\r\n");
}

void test_sensor(void)
{
	u8_t tmpbuf[128] = {0};

	LCD_ShowString(20,80,"test_motion");
	
	init_i2c();
	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = &LSM6DSO_I2C;

	sensor_init();
	lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter
	
	while(1)
	{
		if(single_tap_event)
		{
			lsm6dso_tilt_flag_data_ready_get(&imu_dev_ctx, &is_tilt); //is_tilt = true when a tilt is detected
			if (is_tilt)
			{
				LOG_INF("tilt detected\n");	//¼ì²âµ½·­µ½
				LCD_ShowString(20,100,"test_motion");
			}
			else
			{
				LOG_INF("tap detected\n");	//¼ì²âµ½´¥Åö
				LCD_ShowString(20,100,"test_motion");
			}
			single_tap_event = false;
		}

		if(button_flag)
		{
			lsm6dso_number_of_steps_get(&imu_dev_ctx, (uint8_t*)&steps);
			LOG_INF("steps :%d\r\n", steps);
			sprintf(tmpbuf, "steps :%d\r\n", steps);
			LCD_ShowString(20,120,tmpbuf);
			button_flag = false;
		}
	}
}

void motion_sensor_msg_proc(void)
{
	u8_t tmpbuf[128] = {0};
	extern bool lcd_sleep_out;
	
	if(single_tap_event)
	{		
		single_tap_event = false;
		
		lsm6dso_tilt_flag_data_ready_get(&imu_dev_ctx, &is_tilt); //is_tilt = true when a tilt is detected
		if(is_tilt)
		{
			LOG_INF("tilt detected\n");	//¼ì²âµ½·­µ½

			lcd_sleep_out = true;
			sprintf(tmpbuf, "tilt trige lcd sleep out!");
			LCD_ShowString(20,80,tmpbuf);

		}
		else
		{
			LOG_INF("tap detected\n");	//¼ì²âµ½´¥Åö
		}
	}

	if(button_flag)
	{
		button_flag = false;
		
		lsm6dso_number_of_steps_get(&imu_dev_ctx, (uint8_t*)&steps);
		LOG_INF("steps :%d\r\n", steps);

		sprintf(tmpbuf, "step is:%d", steps);
		LCD_ShowString(20,100,tmpbuf);
	}
}

void ReSetImuSteps(void)
{
	lsm6dso_steps_reset(&imu_dev_ctx);
}

void GetImuSteps(void)
{
	lsm6dso_number_of_steps_get(&imu_dev_ctx, &g_steps);

	g_distance = 0.7*g_steps;
	g_calorie = 0.8214*60*(g_distance/1000);
}

void GetSportData(u16_t *steps, u16_t *calorie, u16_t *distance)
{
	*steps = g_steps;
	*calorie = g_calorie;
	*distance = g_distance;
}

void ImuAutoReadTimeout(struct k_timer *timer)
{
	read_imu_steps = true;
}

void IMU_init(void)
{
	LOG_INF("IMU_init\n");
	
	if(init_i2c() != 0)
		return;
	
	init_gpio();

	imu_dev_ctx.write_reg = platform_write;
	imu_dev_ctx.read_reg = platform_read;
	imu_dev_ctx.handle = &LSM6DSO_I2C;

	sensor_init();
	lsm6dso_steps_reset(&imu_dev_ctx); //reset step counter

	k_timer_init(&get_steps_timer, ImuAutoReadTimeout, NULL);
	k_timer_start(&get_steps_timer, K_MSEC(2500), K_MSEC(5000));
}
